Repository: mmrm11/48764011D
Catalog: omegat/project_save.tmx
Source language: en
Languages: es_es

source: (2004), Grogan (1998), Champion and Furnham (1999).
es_es: (2004), Grogan (1998), Champion y Furnham (1999).

source: (2006) proved the statement that media promotes a thin beauty ideal.
es_es: (2006) demostró la afirmación de que los medios de comunicación promueven un ideal de belleza de delgadez.

source: 87) definition of the term body image’ implies that it is “one’s subjective attitude toward one’s own physical appearance.
es_es: 87) sobre el termino "imagen corporal" implica que es "una actitud subjetiva de una persona hacia su propia apariencia física".

source: 301 qualified specialists online
es_es: 301 especialistas cualificados online

source: A brainy girl possessed a wide range of intellectual abilities; she is the one turned to for an academic answer or advice.
es_es: Una chica inteligente que posee un amplio abanico de capacidades intelectuales; es a ella a quien se acude en busca de una respuesta o consejo académico.

source: A girl in black clothes usually large represents alternative or Goth character.
es_es: Una chica vestida de negro suele representar el carácter alternativo o gótico.

source: A girl would grow in accordance to the wishes and preferences of the mother.
es_es: Una niña crecerá de acuerdo con los deseos y preferencias de la madre.

source: A longitudinal panel study of children revealed that despite the existing gender difference in body obsession, there is no dependence on age and ethnicity (Moriarty, & Harrison, 2008).
es_es: Un estudio longitudinal de panel de niños reveló que, a pesar de la diferencia de género existente en la obsesión por el cuerpo, no hay dependencia de la edad y la etnia (Moriarty, & Harrison, 2008).

source: A mother would speak to her daughter suggesting that the mother’s body image is perfect and the child needs to develop such a body.
es_es: Una madre, en ocasiones, habla a su hija diciéndole que la imagen corporal de la madre es perfecta y que la niña necesita desarrollar un cuerpo así.

source: A number of activities related to eating such as shopping for groceries, planning and preparing of meals, analyzing the effects of food on the health of children, reading nutrition signs, discussing the preferences of various family members and coming up with decisions related to diets, are the roles of the mother.
es_es: Una serie de actividades relacionadas con la alimentación, como hacer la compra, planificar y preparar las comidas, analizar los efectos de los alimentos en la salud de los niños, leer las señales de nutrición, discutir las preferencias de los distintos miembros de la familia y tomar decisiones relacionadas con la dieta, son funciones de la madre.

source: A number of scholars support these statements in their studies of children’s animated movies where thin characters being courteous and kind they tend to prevail over the flabby ones, who are considered rude and aggressive.
es_es: Varios académicos apoyan estas afirmaciones en sus estudios de las películas de animación infantiles, en las que los personajes delgados, siendo corteses y amables, tienden a prevalecer sobre los flácidos, considerados groseros y agresivos.

source: A person is likely to model behaviors seen under the following conditions are present – attention, retention, reproduction, and motivation.
es_es: Es probable que una persona modele conductas observadas si se dan las siguientes condiciones: atención, retención, reproducción y motivación.

source: A range of studies conducted by American organizations such as the US Center for Disease Control and National Health and Nutrition Examination Survey team identified high rates of children classified as overweight (Bissell, & Hays, 2011).
es_es: Un gran abanico de estudios llevados a cabo por organizaciones norteamericanas como el US Center for Disease Control y National health and Nutrtion Examination Survey team identificaron un alto índice de niños clasificados como obesos (Bissell, & Hays, 2011).

source: A strong relationship has been found between the early dissatisfaction with the body shape in children, and images in writings of various scholars on the body sizes.
es_es: Se ha encontrado una fuerte relación entre la insatisfacción corporal temprana en niños, e imágenes y escritos de diferentes académicos acerca de los tipos de cuerpos.

source: A study conducted by Jaffe and Worobey in 2006 on body image indicated that a strong relationship exists between mothers and daughters regarding eating, dieting and the body image.
es_es: Un estudio realizado por Jaffe y Worobey en 2006 sobre la imagen corporal indicó que existe una fuerte relación entre madres e hijas en lo que respecta a la alimentación, las dietas y la imagen corporal.

source: A study conducted in Japan by Mukai in 1996 demonstrated that same-sex friends and mothers influenced adolescent girls to adopt some eating behaviors and attitudes.
es_es: Un estudio realizado en Japón por Mukai en 1996 demostró que los amigos del mismo sexo y las madres influían en las adolescentes para que adoptaran algunas conductas y actitudes alimentarias.

source: A woman weighing 140 pounds is perceived to be healthy since weight would make her attractive irrespective of the beauty.
es_es: Una mujer que pesa 63kg se considera que esta sana, ya que el peso la hace atractiva independientemente de su belleza.

source: According to Champion and Furnham (1999), their weight seems to be inappropriate for the existing standards of physical attractiveness.
es_es: Según Champion y Furnham (1999), su peso parece inadecuado para los estándares de atractivo físico existentes.

source: According to Monnot (2010), the role of female pop singers is crucial in the process of girls’ development in the age span from nine to 11 years.
es_es: Según Monnot (2010), el papel de las cantantes pop femeninas es crucial en el proceso de desarrollo de las niñas desde los nueve años hasta los once.

source: According to a number of studies, eating disorders are mostly diagnosed to women.
es_es: Según varios estudios, los trastornos alimentarios se diagnostican sobre todo a mujeres.

source: Adolescence is usually considered a stage where the social atmosphere and social interactions play a big role in determining the health and satisfactory image of a teenager.
es_es: La adolescencia suele considerarse una etapa en la que el ambiente social y las interacciones sociales desempeñan un gran papel a la hora de determinar la salud y la imagen satisfactoria de un adolescente.

source: Adolescents would tend to spend little time with their parents and more time with their friends as they turn sixteen (Knauss, Paxton, & Alsaker, 2007).
es_es: Los adolescentes tenderían a pasar poco tiempo con sus padres y más con sus amigos cuando cumplen dieciséis años (Knauss, Paxton y Alsaker, 2007).

source: Adults’ obsession with body image is frequently passed on to younger generations.
es_es: La obsesión de los adultos con la imagen corporal transmitida frecuentemente a generaciones más jóvenes.

source: Affected by media, family, and peers, most of the contemporary girls take a number of actions to make their bodies slimmer (Krcmar et al.
es_es: Afectadas por los medios de comunicación, la familia y compañeros, la mayoría de las chicas contemporáneas adoptan una serie de medidas para adelgazar su cuerpo (Krcmar et al 2008).

source: Among peers, certain body images would be adopted while some would be discouraged.
es_es: Entre iguales, se adoptan ciertas imágenes corporales y se desaconsejan otras.

source: Anorexia and bulimia are considered psychological diseases since they are an eating disorder evolved due to emotional desires rather than physical inability to consume food.
es_es: La anorexia y la bulimia son consideradas enfermedades mentales ya que son un trastorno alimentario evolucionado debido a deseos emocionales más que la incapacidad física para consumir alimentos.

source: Another concept of Bandura’s Social Learning Theory concerns intrinsic reinforcement.
es_es: Otro concepto de la Teoría del Aprendizaje Social de Bandura se refiere al refuerzo intrínseco.

source: Another serious consequence of the popularization of slenderness is obesity.
es_es: Otra consecuencia serie a raíz de la popularización de la delgadez es la obesidad.

source: As a result, a large percentage of girls (up to 90%) and boys (up to 75%) experience body dissatisfaction (Markey, & Markey, 2010).
es_es: Como resultado de esto, un gran porcentaje de chicas (hasta el 90%) y chicos (hasta el 75%) sufren de insatisfacción corporal (Markey, & Markey, 2010)

source: As a result, adolescent girls make much effort to move and look like their idols through wearing similar clothes that are inappropriate for their age.
es_es: Como consecuencia, las adolescentes se esfuerzan mucho por moverse y parecerse a sus ídolos vistiendo ropa similar, inapropiada para su edad.

source: As a result, children, especially girls, start imitating what they have seen on television, advertising, video games, and magazines.
es_es: Como consecuencia, los niños, especialmente las niñas, empiezan a imitar lo que han visto en la televisión, la publicidad, los videojuegos y las revistas.

source: As a result, many of the modern children suffer from either anorexia or obesity.
es_es: Como resultado, muchos niños sufren de anorexia u obesidad.

source: As a result, popular beauty messages arouse body dissatisfaction and other negative manifestations among children and girls in particular.
es_es: En consecuencia, los mensajes populares sobre la belleza despiertan insatisfacción corporal y otras manifestaciones negativas entre los niños y las niñas en particular.

source: As a result, the contemporary culture and its perception of bodily beauty affect both women and men of all ages.
es_es: Por consiguiente, la cultura actual y su percepción de la belleza corporal afecta tanto a hombres como a mujeres de todas las edades.

source: As a result, their levels of self-esteem turned to be lower than of those not concerned with body image.
es_es: Como resultado, sus niveles de autoestima resultaron ser más bajos que los de aquellas a las que no les preocupaba la imagen corporal.

source: As it has already been mentioned, one of the substantial negative consequences of girls’ obsession with the current body image is low levels of self-esteem.
es_es: Como ya se ha mencionado, una de las consecuencias negativas sustanciales de la obsesión de las chicas por la imagen corporal actual son los bajos niveles de autoestima.

source: As it has been already stated, media content produces a significant influence on children’s behaviors and perception of the concept of body image.
es_es: Como ya se ha dicho, el contenido de los medios de comunicación produce una influencia significativa en los comportamientos de los niños y en su percepción del concepto de imagen corporal.

source: As opposition to the current standards of physical attractiveness, a vast number of today’s children suffer from obesity.
es_es: En oposición a los estándares actuales del atractivo físico, una gran cantidad de los niños de hoy en día sufren de obesidad.

source: As time goes by, adolescents spent less time with their parents and more time with peers.
es_es: Con el paso del tiempo, los adolescentes pasan menos tiempo con sus padres y más con sus compañeros.

source: At such weight, a woman must perform her duties well (Hayes & TantIeff-Dunn, 2010).
es_es: Con ese peso, una mujer debe ser capaz de realizar sus obligaciones correctamente (Hayes & Tantleff-Dunn, 2010).

source: At the same time, Ryan & Morrison observed that two out of five women and about 20% of all men would forgo 3-5 years of their lives for the sake of obtaining the physical shape of their dream.
es_es: A su vez, Ryan y Morrison observaron que dos de cinco mujeres y al rededor de un 20% de hombres renuncian a sus vidascon tal de obtener la forma física de sus sueños.

source: At the same time, the characters reflecting evil are illustrated as ugly, unattractive, and flabby (Hayes & TantIeff-Dunn, 2010).
es_es: Al mismo tiempo, las personas que reflejan maldad se ilustran como feos, poco atractivos y flácidos (Hayes & TantIeff-Dunn, 2010). .

source: At the same time, they wear immodest clothes on their fashion model like bodies.
es_es: Al mismo tiempo, visten ropas impúdicas en sus cuerpos que parecen modelos de moda.

source: At this age, they would start talking about the perfect body images (Kashubeck, Marchand-Martella, Neal, & Larsen, 1997).
es_es: A esta edad, empezarían a hablar de las imágenes corporales perfectas (Kashubeck, Marchand-Martella, Neal, (Kashubeck, Marchand-Martella, Neal y Larsen, 1997).

source: Athletic kind of beauty is peculiar to girls naturally pretty who are more interested in sports than boys are or fashion (Northup & Liebler, 2010).
es_es: El tipo de belleza atlética es propio de las chicas naturalmente guapas que están más interesadas en los deportes que los chicos o en la moda (Northup y Liebler, 2010).

source: Bandura proclaimed that observational learning is an integrated component of learning.
es_es: Bandura proclamó que el aprendizaje mediante la observación es un componente integrado en el aprendizaje.

source: Bandura’s theory is of a terrific value not only for psychologists, but also for those individuals involved in the sphere of education since it emphasizes the importance of behavior modeling in the classroom environment.
es_es: La teoría de Bandura tiene un gran valor no solo para los psicólogos, sino también para las personas que trabajan en el ámbito de la educación, ya que subraya la importancia del ejemplo de comportamiento en el aula.

source: Based on the traditional approach, Bandura’s theory includes a social element as a core factor of learning enforcement.
es_es: Basada en el enfoque tradicional, la teoría de Bandura incluye un elemento social como factor central de la aplicación del aprendizaje.

source: Before influencing the body image of children, mothers start asking themselves whether they feel good about their own body sizes.
es_es: Antes de influir en la imagen corporal de los hijos, las madres empiezan por preguntarse si se sienten bien con sus propias tallas corporales.

source: Being fat, which is contrary to the models’ weight, is associated with a number of negative social attributes such as lethargy, self-indulgence, and slovenliness (Champion & Furnham, 1999).
es_es: Estar gordo, considerado como contrario al estándard de peso, se asocia con varios atributos sociales negativos como pereza, autocomplaciente y dejadez.

source: Being obsessed with characters observed most kids are eager to imitate behaviors of their ideals.
es_es: Al estar obsesionados con los personajes observados, la mayoría de los niños desean imitar los comportamientos de sus ideales.

source: Besides, they start dieting to achieve the same body proportions as female singers who are mostly thin, tanned, long-legs, and long-haired.
es_es: Además, empiezan a hacer dieta para conseguir las mismas proporciones corporales que las cantantes, que en su mayoría son delgadas, bronceadas, de piernas largas y pelo largo.

source: Body dissatisfaction has always been considered more prevalent among girls and women than it is among boys and men.
es_es: Siempre se ha considerado que la insatisfacción corporal es más frecuente entre las niñas y las mujeres que entre los niños y los hombres.

source: Body sizes are effects of poor diets because unbalanced diet leads to development of obesity.
es_es: Las tallas son efectos de las dietas pobres, ya que una dieta desequilibrada conduce al desarrollo de la obesidad.

source: Both men and women experience body dissatisfaction, which results in psychological discomfort about their body shapes and weight.
es_es: Ambos, mujeres y hombres, experimentan insatisfacciones con su cuerpo, lo que resulta malestar sobre la forma de su cuerpo y su peso .

source: Boys who also watch a lot of television are taught that physically attractive girls are more nice and friendly than their brainy peers (Northup & Liebler, 2010).
es_es: A los chicos que también ven mucha televisión se les enseña que las chicas físicamente atractivas son más agradables y simpáticas que sus compañeras inteligentes (Northup y Liebler, 2010).

source: Boys would try as much as possible to emulate their fathers by employing all available means to develop muscles.
es_es: Los chicos intentan emular a sus padres en la medida de lo posible, empleando todos los medios disponibles para desarrollar los músculos.

source: Champion and Furnham (1999) investigated a number of earlier empirical works dedicated to understanding body dissatisfaction among adolescent girls.
es_es: Champion y Furnham (1999) investigaron una serie de trabajos empíricos anteriores dedicados a comprender la insatisfacción corporal entre las adolescentes.

source: Characters in video games reflect trends existing in society; thus, they contain many violent scenes popular in other media resources.
es_es: Los personajes de los videojuegos reflejan las tendencias existentes en la sociedad; por tanto, contienen muchas escenas violentas populares en otros recursos mediáticos.

source: Children grow up knowing that only recommended shapes are allowed in society.
es_es: Los niños crecen sabiendo que en la sociedad sólo se permiten las formas recomendadas.

source: Children introduced to such weight interpretations and beauty stereotypes experience problems as regards to eating behaviors from early childhood.
es_es: Los niños que son expuestos a estas interpretaciones de estereotipos acerca del peso y la belleza experimentan problemas relacionados con la alimentación desde la niñez temprana.

source: Children of the same sex would consult over intimate relationships, including outlining the best body figures that would attract a partner of opposite sex.
es_es: Los niños del mismo sexo consultaban sobre las relaciones íntimas, incluso esbozaban las mejores figuras corporales que atraerían a una pareja del sexo opuesto.

source: Children start imitating aggressive actions and behaviors when asked to play with the doll.
es_es: Los niños empiezan a imitar acciones y comportamientos agresivos cuando se les pide que jueguen con el muñeco.

source: Children would frequently try to do everything possible to ensure that they are acceptable in society.
es_es: Con frecuencia, los niños intentarían hacer todo lo posible para ser aceptados en la sociedad.

source: Children would want to be like their close friends in terms of body figures hence they would seek the advice of friends on how to lose weight.
es_es: Los niños querrían parecerse a sus amigos íntimos en cuanto a figura corporal, de ahí que busquen el consejo de sus amigos sobre cómo perder peso.

source: Classic beauty is characterized by traditional femininity such as long hair, fashionable clothes with little amount of accessories, and a general soft image.
es_es: La belleza clásica se caracteriza por la feminidad tradicional, como el pelo largo, la ropa de moda con pocos accesorios y una imagen suave en general.

source: Conclusion
es_es: Conclusión

source: Consequences of Body Dissatisfaction
es_es: Consecuencias de las inseguridades corporales

source: Contemporary television and advertising promote of masculine male beauty, which is a traditional approach to men’s physical appearance.
es_es: La televisión y la publicidad contemporáneas promueven la belleza masculina, que es un enfoque tradicional del aspecto físico de los hombres.

source: Defining Body Image and Prevalence Rates
es_es: Definición de la imagen corporal y las tasas de prevalencia

source: Dohnt and Tiggermann (2006) conducted a research of girls’ audience aged from five to eight years to identify media influence on them.
es_es: Dohnt y Tiggermann (2006) llevaron a cabo una investigación entre niñas de cinco a ocho años para determinar la influencia de los medios de comunicación en ellas.

source: Due to individual mental states of the audience, media produce different impact of children perception levels of body image.
es_es: Debido a los estados mentales individuales de la audiencia, los medios de comunicación producen un impacto diferente en los niveles de percepción de la imagen corporal de los niños.

source: During adolescence, children try to emulate the lives of their peers, particularly when it comes to body image.
es_es: Durante la adolescencia, los niños intentan emular la vida de sus compañeros, sobre todo en lo que se refiere a la imagen corporal.

source: During this time, they are introduced with a vast amount of TV shows, films, and programs where thinness and physical attractiveness are promoted as main female qualities.
es_es: Durante este tiempo, se les presenta una gran cantidad de series, películas y programas en los que se promueve la delgadez y el atractivo físico como principales cualidades femeninas.

source: Each socializing agent affects children in differently.
es_es: Cada agente socializador afecta a los niños de forma diferente.

source: Effective learning requires full attention; thus, the content should be entertaining and catching.
es_es: Un aprendizaje eficaz requiere atención plena; por tanto, el contenido debe ser entretenido y llamativo.

source: Even in their early ages, mothers teach girls the importance of ideal bodies, which would be appreciated by culture.
es_es: Incluso en edades tempranas, las madres enseñan a las niñas la importancia de tener un cuerpo ideal, lo que sería apreciado por la cultura.

source: Even though few researchers have tried to conduct studies regarding the influence of peers on the body images of children, it has been established that friendship affects the body image, diets, and behaviors of children.
es_es: Aunque pocos investigadores han intentado realizar estudios sobre la influencia de los compañeros en la imagen corporal de los niños, se ha establecido que la amistad afecta a la imagen corporal, las dietas y los comportamientos de los niños.

source: Family relationships play a considerable role in a person’s development and perception of body image.
es_es: Las relaciones familiares juegan un papel importante en el desarrollo y la percepción de la imagen corporal de una persona.

source: Fashion shows make their contribution to children, especially girls’ obsessions with a particular body proportions.
es_es: Los programas de moda contribuyen a la obsesión de los niños, sobre todo de las niñas, por unas proporciones corporales determinadas.

source: Female ideals are conceptualized as more rigid and unachievable in the modern media, which brings about greater rates of dissatisfaction with their bodies nowadays.
es_es: Los ideales femeninos se conceptualizan como más rígidos e inalcanzables en los medios de comunicación modernos, lo que provoca mayores índices de insatisfacción con sus cuerpos en la actualidad.

source: Female singers are associated with the standards of the contemporary femininity’.
es_es: Las cantantes se asocian a los estándares de la «feminidad contemporánea».

source: Females who start comparing themselves with media ideals while developing a sense of self-awareness (Northup & Liebler, 2010) represent a large number of the youth audience.
es_es: Las mujeres que empiezan a compararse con los prototipos de las redes mientras desarrollan un sentido de autoconciencia (Northup & Liebler, 2010) representan un gran número de la audiencia juvenil.

source: Femininity is associated with thin bodies while masculinity is related to muscles meaning men should have strong muscles.
es_es: La feminidad se asocia con cuerpos delgados, mientras que la masculinidad se relaciona con los músculos, lo que significa que los hombres deben tener músculos fuertes.
